{
    "head": {
        "title": "Lets Be Frank",
        "dateModified": "Mon, 27 Dec 2021 20:21:19 GMT",
        "ownerName": "Frank McPherson",
        "ownerEmail": "frank.mcpherson@gmail.com",
        "expansionState": "",
        "lastCursor": 0,
        "urlPublic": "http://drummer.scripting.com/frankm/LBF2017-11.opml",
        "urlJson": "http://drummer.scripting.com/frankm/LBF2017-11.json",
        "flPublic": true,
        "urlUpdateSocket": "ws://drummer.scripting.com:1232/",
        "ownerTwitterScreenName": "frankm",
        "ownerId": "http://twitter.com/frankm",
        "dateCreated": "Mon, 27 Dec 2021 20:21:19 GMT"
    },
    "body": {
        "subs": [
            {
                "text": "11/2/2017",
                "created": "Thu, 02 Nov 2017 15:20:33 GMT",
                "subs": [
                    {
                        "text": "Thursday, November 2, 2017",
                        "created": "Thu, 02 Nov 2017 15:20:33 GMT",
                        "type": "outline",
                        "subs": [
                            {
                                "text": "<a href=\"https://theathletic.com/24680/2016/11/03/it-wasnt-all-a-dream-the-cubs-really-won-the-world-series/\">A year ago</a> tonight (or really early tomorrow morning ET) the Chicago Cubs won the 2016 World Series. Watching the Astros celebrate caused me to remember <a href=\"http://writing.frankmcpherson.org/2016/11/03/thisIsTheYear.html\">the euphoria I felt</a> a year ago.&nbsp;",
                                "created": "Thu, 02 Nov 2017 15:20:34 GMT"
                            }
                        ]
                    }
                ]
            },
            {
                "text": "11/5/2017",
                "created": "Sun, 05 Nov 2017 20:32:53 GMT",
                "subs": [
                    {
                        "text": "Sunday, November 5, 2017",
                        "created": "Sun, 05 Nov 2017 20:32:53 GMT",
                        "type": "outline",
                        "subs": [
                            {
                                "text": "<span style=\"-webkit-text-size-adjust: 100%;\">God spoke to Cain: “Why this tantrum? Why the sulking? If you do well, won’t you be accepted? And if you don’t do well, sin is lying in wait for you, ready to pounce; it’s out to get you, </span><strong style=\"-webkit-text-size-adjust: 100%;\">you’ve got to master it</strong><span style=\"-webkit-text-size-adjust: 100%;\">.” -Genesis 4:6–7, The Message</span>  ",
                                "created": "Sun, 05 Nov 2017 20:32:54 GMT"
                            },
                            {
                                "text": "You’re familiar with the command to the ancients, ‘Do not murder.’ I’m telling you that <strong>anyone who is so much as angry with a brother or sister is guilty of murder.</strong> Carelessly call a brother ‘idiot!’ and you just might find yourself hauled into court. Thoughtlessly yell ‘stupid!’ at a sister and you are on the brink of hellfire. The simple moral fact is that words kill. - Matthew 5:21–22, The Message  ",
                                "created": "Sun, 05 Nov 2017 20:32:55 GMT"
                            },
                            {
                                "text": "<span style=\"-webkit-text-size-adjust: 100%;\">Emphasis mine.</span>",
                                "created": "Sun, 05 Nov 2017 20:32:56 GMT"
                            }
                        ]
                    }
                ]
            },
            {
                "text": "11/13/2017",
                "created": "Mon, 13 Nov 2017 14:28:00 GMT",
                "subs": [
                    {
                        "text": "Monday, November 13, 2017",
                        "created": "Mon, 13 Nov 2017 14:28:00 GMT",
                        "type": "outline",
                        "subs": [
                            {
                                "text": "Microsoft has changed the inking in OneNote for iOS. First they changed ink colors and I now cannot use the blue I had been using. When I select More Ink Colors, select a color and select apply, the color does not stick, instead it defaults to black!",
                                "created": "Mon, 13 Nov 2017 14:28:01 GMT"
                            },
                            {
                                "text": "Another problem I am having is with ink thickness. I am pretty sure the medium thickness is thicker than I have been using, while the next level down seems too think. I've been used to the ink looking like writing with a marker, but if it is too thick letters get blurred together and can become hard to read.",
                                "created": "Mon, 13 Nov 2017 14:28:02 GMT"
                            }
                        ]
                    }
                ]
            },
            {
                "text": "11/14/2017",
                "created": "Tue, 14 Nov 2017 16:10:24 GMT",
                "subs": [
                    {
                        "text": "Tuesday, November 14, 2017",
                        "created": "Tue, 14 Nov 2017 16:10:24 GMT",
                        "type": "outline",
                        "subs": [
                            {
                                "text": "Apparently the <a href=\"https://www.fastcompany.com/40495831/compuserves-forums-which-still-exist-are-finally-shutting-down\">Compuserve forums</a> have been open and are just being shut down.&nbsp;",
                                "created": "Tue, 14 Nov 2017 16:10:25 GMT"
                            },
                            {
                                "text": "The 2016 Democratic Party primary only looks rigged to those who either don't know or don't want to admit how party politics works. <a href=\"https://www.vox.com/policy-and-politics/2017/11/14/16640082/donna-brazile-warren-bernie-sanders-democratic-primary-rigged\">Vox has a good article</a> summarizing how the party coalesced around Clinton and how her path to nomination was cleared, and there is nothing abnormal about it.&nbsp;&nbsp;",
                                "created": "Tue, 14 Nov 2017 16:10:26 GMT"
                            },
                            {
                                "text": "Vox concludes that there should have been more candidates in the Democratic primary, but I think that is convenient thinking that overlooks primary history. Jimmy Carter's re-election bid was thwarted part by a internal party struggle between he and Ted Kennedy. It is generally believed that a party should quickly fall in to line behind an incumbent president seeking re-election because that demonstrates unity and more importantly consolidates money.&nbsp;",
                                "created": "Tue, 14 Nov 2017 16:10:27 GMT"
                            },
                            {
                                "text": "Another important point that Bernie supporters refuse to accept is that he is not a Democrat. Two people attempted to hijack party nominations, one succeeded and became president while the other failed against a long-time Democrat. I just don't understand why anyone would think the Democrat elites, who really run the party, would ever blindly accept Bernie with open arms.&nbsp;",
                                "created": "Tue, 14 Nov 2017 16:10:28 GMT"
                            },
                            {
                                "text": "Those with a beef with the fact that Bernie didn't get a \"fair shot\" really have a beef with our overall political party process, and that is not really just a Democrat or Republican thing.&nbsp;",
                                "created": "Tue, 14 Nov 2017 16:10:29 GMT"
                            }
                        ]
                    }
                ]
            },
            {
                "text": "11/17/2017",
                "created": "Fri, 17 Nov 2017 18:34:59 GMT",
                "subs": [
                    {
                        "text": "Pixel 2 Battery Life",
                        "created": "Fri, 17 Nov 2017 18:34:59 GMT",
                        "type": "outline",
                        "subs": [
                            {
                                "text": "I've been using the Pixel 2 for a couple weeks now, enough time to get a feel for battery life. I use <a href=\"https://play.google.com/store/apps/details?id=com.digibites.accubattery&amp;hl=en\">AccuBattery Pro</a> to monitor battery life, particularly paying attention to the percentage of screen off time in deep sleep and correspondingly the percentage decrease in battery while the screen is off.&nbsp;",
                                "created": "Fri, 17 Nov 2017 18:35:00 GMT"
                            },
                            {
                                "text": "Generally, I am finding battery life on the Pixel 2 to be no better or worse than the Nexus 6P. When all is right I see nearly 75% of screen of time in deep sleep and about 1.5% battery decrease while the screen is off. AccuBattery estimates 5h 18m of screen on time, 36h 22m of screen off time, and 25h 39m of combined use time.&nbsp; All these numbers align to my use case.",
                                "created": "Fri, 17 Nov 2017 18:35:01 GMT"
                            },
                            {
                                "text": "I have found that for some reason Google's automatic wallpaper change prevents the phone from going in to deep sleep and therefore battery consumption jumps to around 5% of screen off time. Consequently, I don't let Android automatically change the wallpaper. Clearly there is some bad programming with that feature because I don't understand why such a thing should prevent the phone from going into deep sleep. In fact, I thought Android O came with a feature that better managed such bad behavior by forcing apps to allow deep sleep.&nbsp;",
                                "created": "Fri, 17 Nov 2017 18:35:02 GMT"
                            }
                        ]
                    }
                ]
            },
            {
                "text": "11/20/2017",
                "created": "Mon, 20 Nov 2017 15:38:42 GMT",
                "subs": [
                    {
                        "text": "Monday, November 20, 2017",
                        "created": "Mon, 20 Nov 2017 15:38:42 GMT",
                        "type": "outline",
                        "subs": [
                            {
                                "text": "Much <a href=\"https://www.theatlantic.com/politics/archive/2017/11/republicans-are-throwing-away-their-shot-at-tax-reform/546317/\">talk about lowering the corporate tax rate to 25%</a> with common thinking that corporations like it and it hurts regular people. Except many corporations won't like like because right now they pay nearly no tax thanks to all the loopholes.&nbsp;",
                                "created": "Mon, 20 Nov 2017 15:38:43 GMT"
                            },
                            {
                                "text": "I am reading <a href=\"https://www.instapaper.com/text?u=http%3A%2F%2Fiml.jou.ufl.edu%2Fcarlson%2Fhistory%2Fcompuserve.htm\">articles about Compuserve</a>, which has me wonder when I closed my account. I still remember my ID: <a href=\"http://absolutewrite.com/forums/showthread.php?240474-76275-332-And-what-was-YOUR-CompuServe-ID\">73217,351</a>.&nbsp;",
                                "created": "Mon, 20 Nov 2017 15:38:44 GMT"
                            },
                            {
                                "text": "Wikipedia has <a href=\"https://en.wikipedia.org/wiki/CompuServe\">a good article about Compuserve</a>, and here is <a href=\"https://www.youtube.com/watch?v=I9JtqLgWoMo\">an episode on Compuserve</a> of the Internet History Podcast.",
                                "created": "Mon, 20 Nov 2017 15:38:45 GMT"
                            }
                        ]
                    }
                ]
            },
            {
                "text": "11/26/2017",
                "created": "Sun, 26 Nov 2017 16:56:51 GMT",
                "subs": [
                    {
                        "text": "Sunday, November 26, 2017",
                        "created": "Sun, 26 Nov 2017 16:56:51 GMT",
                        "type": "outline",
                        "subs": [
                            {
                                "text": "As we look ahead toward the second year of the Trump presidency, we need to start asking more why questions. Why will the tax cut improve lives? Why will limitations on immigration make us safer? And, we have to patiently continue to ask until the questions are answered. ",
                                "created": "Sun, 26 Nov 2017 16:56:52 GMT"
                            },
                            {
                                "text": "I am trying <a href=\"https://www.wired.com/story/firefox-quantum-the-browser-built-for-2017/\">Firefox Quantum</a> across my devices to see whether I will like it better than Chrome. One thing I find appealing is its integrated <a href=\"https://support.mozilla.org/en-US/kb/firefox-reader-view-clutter-free-web-pages\">Reader View</a> that makes it easier to read content on my iPad. I have Safari on my iPad configured to automatically display all pages in Reader mode. So far Google refuses to provide such a mode, which is an example of how their advertising-based revenue model conflicts with users.",
                                "created": "Sun, 26 Nov 2017 16:56:53 GMT"
                            },
                            {
                                "text": "If anyone who reads this blog can help me, I would like to figure out how to center the body of this site when it is rendered in portrait orientation on iOS devices. Right now when you load this page in portrait the left side of the middle portion of this page aligns to the FrankNet drop down menu, but when you rotate the device to landscape view the left side shifts left, lining up basically under the \"r\" of the \"Let's Be Frank\" at the top of the display. ",
                                "created": "Sun, 26 Nov 2017 16:56:54 GMT"
                            }
                        ]
                    }
                ]
            }
        ]
    }
}